import React from 'react';

export default (
<svg width="15px" height="14px" viewBox="0 0 15 14" version="1.1">
  <defs>
    <rect id="path-1" x="0.5" y="0" width="192" height="40" rx="20" />
    <filter x="-6.8%" y="-27.5%" width="113.5%" height="165.0%" filterUnits="objectBoundingBox" id="filter-2">
      <feOffset dx="0" dy="2" in="SourceAlpha" result="shadowOffsetOuter1" />
      <feGaussianBlur stdDeviation="4" in="shadowOffsetOuter1" result="shadowBlurOuter1" />
      <feColorMatrix values="0 0 0 0 0   0 0 0 0 0   0 0 0 0 0  0 0 0 0.1 0" type="matrix" in="shadowBlurOuter1" />
    </filter>
  </defs>
  <g id="04规则配置" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
    <g id="规则决策树-节点默认属性" transform="translate(-145.000000, -149.000000)">
      <rect x="0" y="0" width="1440" height="800" />
      <g id="页头" transform="translate(0.000000, 161.000000)">
        <rect id="矩形" x="0" y="0" width="1232" height="68" />
      </g>
      <g id="导航">
        <g id="顶部导航" />
      </g>
      <g id="Group" transform="translate(24.000000, 136.000000)">
        <g id="Rectangle">
          <use fill="black" fillOpacity="1" filter="url(#filter-2)" />
          <use fill="#FFFFFF" fillRule="evenodd" />
        </g>
        <g id="General/icon/16px" transform="translate(120.500000, 12.000000)" fill="#000000" fillOpacity="0.45">
          <g id="Icon/02-Line/1:1">
            <path d="M2.5,2.5 L2.5,13.5 L13.5,13.5 L13.5,2.5 L2.5,2.5 Z M1.875,1.375 L14.125,1.375 C14.4011424,1.375 14.625,1.59885763 14.625,1.875 L14.625,14.125 C14.625,14.4011424 14.4011424,14.625 14.125,14.625 L1.875,14.625 C1.59885763,14.625 1.375,14.4011424 1.375,14.125 L1.375,1.875 C1.375,1.59885763 1.59885763,1.375 1.875,1.375 Z M8,8.625 C8.37969577,8.625 8.6875,8.93280423 8.6875,9.3296875 C8.6875,9.69219577 8.37969577,10 8,10 C7.62030423,10 7.3125,9.69219577 7.3125,9.3296875 C7.3125,8.93280423 7.62030423,8.625 8,8.625 Z M8,6 C8.37969577,6 8.6875,6.30780423 8.6875,6.7046875 C8.6875,7.06719577 8.37969577,7.375 8,7.375 C7.62030423,7.375 7.3125,7.06719577 7.3125,6.7046875 C7.3125,6.30780423 7.62030423,6 8,6 Z M4.6875,5.1875 L5.625,5.1875 C5.69403559,5.1875 5.75,5.25045996 5.75,5.328125 L5.75,10.671875 C5.75,10.74954 5.69403559,10.8125 5.625,10.8125 L4.6875,10.8125 C4.61846441,10.8125 4.5625,10.74954 4.5625,10.671875 L4.5625,5.328125 C4.5625,5.25045996 4.61846441,5.1875 4.6875,5.1875 Z M10.375,5.1875 L11.3125,5.1875 C11.3815356,5.1875 11.4375,5.25045996 11.4375,5.328125 L11.4375,10.671875 C11.4375,10.74954 11.3815356,10.8125 11.3125,10.8125 L10.375,10.8125 C10.3059644,10.8125 10.25,10.74954 10.25,10.671875 L10.25,5.328125 C10.25,5.25045996 10.3059644,5.1875 10.375,5.1875 Z" id="Shape" />
          </g>
        </g>
      </g>
    </g>
  </g>
</svg>
)